/************************************************************************************/
/** \file LowVoltProt.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Fan Ultra Edition
/** \Description 这个头文件声明了系统关于低电量阶梯降档和关机保护的业务处理逻辑的函数

**	History: Initial Release
**	
/************************************************************************************/
#ifndef _LVProt_
#define _LvProt_
/************************************************************************************/
/* Include files */
/************************************************************************************/
#include "stdbool.h"

/************************************************************************************/
/* Extern Functions definition                                                      */
/************************************************************************************/

//普通挡位的警报函数
void BatteryLowAlertProcess(bool IsNeedToShutOff,ModeIdxDef ModeJump); 

//电池低电量报警模块相关计时器的处理函数
void BattAlertTIMHandler(void); 

#endif /* _LVProt_ */

/********************************  End Of File  *************************************/
