/************************************************************************************/
/** \file ADCCfg.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Fan Ultra Edition
/** \Description 这个头文件为系统温度保护逻辑的处理函数声明

**	History: Initial Release
**	
/************************************************************************************/
#ifndef _TempControl_
#define _TempControl_
/************************************************************************************/
/* Include files */
/************************************************************************************/

/************************************************************************************/
/* Extern Functions definition */
/************************************************************************************/	

void TempSensorStallDetect(void);   //温度传感检测
bit QueryIfSysThermalIsOK(void);   //获取温度系统是否允许开机
void OverHeatProtect(void);        //过热保护处理
void TempDegDetect(void); 				 //线性降额计算

/************************************************************************************/
/* Extern Flags and Variable definition */
/************************************************************************************/
extern xdata float DutyLimit;                           //占空比限制
extern xdata float VoltageLimit;                        //电压限制

#endif /* _TempControl_ */

/*********************************  End Of File  ************************************/
