/************************************************************************************/
/** \file delay.h
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Fan Ultra Edition
/** \Description 这个头文件负责声明系统时基生成和软件延时模块的函数和外部flag供其他地方
								 调用。

**	History: Initial Release
**	
/************************************************************************************/
#ifndef _Delay_
#define _Delay_

/************************************************************************************/
/* Extern Flags and Variable definition */
/************************************************************************************/
extern volatile bit SysHFBitFlag;  //系统定时心跳Flag

/************************************************************************************/
/* Extern Functions definition */
/************************************************************************************/
void StartSystemTimeBase(void);  //初始化系统心跳定时器和延时模块
void delay_ms(int ms);           //进行软件延时


/************************************************************************************/
/* Extern Fast Operation Macro definition */
/************************************************************************************/

//禁用系统心跳定时器，直接关闭定时器并除能中断
#define DisableSysHBTIM() do{T2CON=0x00;IE&=(~0x20);}while(0) 


#endif /* _Delay_ */

/*********************************  End Of File  ************************************/
