/****************************************************************************/
/** \file LVDCtrl.c
/** \Author redstoner_35
/** \Project Xtern Ripper Hyper Fan Ultra Edition
/** \Description 这个文件负责驱动系统的WUT，为避免电池饿死的LVD欠压自杀功能提供
								 支持。
**
**	History:
				2026年9月11日 Initial Release
**	
*****************************************************************************/
/****************************************************************************/
/*	include files
*****************************************************************************/
#include "cms8s6990.h"
#include "LVDCtrl.h"

/****************************************************************************/
/* Global Function implementation - (in header files with 'extern')
****************************************************************************/	

//启动低电压检测模块
void LVD_Start(void)
	{	
  //配置WUT唤醒时间=8uS*256*4096=8388mS
	WUTCRL=0xFF;
	WUTCRH=0xBF;
	}

//关闭低电压检测
void LVD_Disable(void)
	{
	WUTCRH=0;
	WUTCRL=0;
	}
/*****************************  End Of File  ******************************/
