#include <stdbool.h>

/*-------------------------------------------------------------
 This is an automatically generated file by NTC resistor LUT 
 generator. DO NOT EDIT UNLESS YOU FULLY UNDERSTAND WHAT THIS
 FILE ACTUALLY DOES!
 NTC PARAMETER:50.00KΩ @ 25℃ B3950
 Table temperature range:-40℃ to 100℃
 Total ROM space for table:400 Bytes
 Target MCU Architecture:8051 Based MCU
-------------------------------------------------------------*/


code unsigned long NTCTableTop[60]={
2009298, 1869051, 1739663, 1620216,   //-40 到 -37 摄氏度
1509876, 1407884, 1313549, 1226244,   //-36 到 -33 摄氏度
1145394, 1070478, 1001019, 936581,   //-32 到 -29 摄氏度
876767, 821214, 769587, 721584,   //-28 到 -25 摄氏度
676925, 635354, 596638, 560560,   //-24 到 -21 摄氏度
526923, 495546, 466261, 438916,   //-20 到 -17 摄氏度
413369, 389490, 367159, 346265,   //-16 到 -13 摄氏度
326707, 308390, 291228, 275140,   //-12 到 -9 摄氏度
260053, 245897, 232609, 220130,   //-8 到 -5 摄氏度
208406, 197386, 187024, 177276,   //-4 到 -1 摄氏度
168103, 159465, 151330, 143664,   //0 到 3 摄氏度
136437, 129622, 123193, 117125,   //4 到 7 摄氏度
111396, 105985, 100872, 96040,   //8 到 11 摄氏度
91470, 87147, 83057, 79185,   //12 到 15 摄氏度
75519, 72046, 68754, 65635    //16 到 19 摄氏度
};

code unsigned int NTCTableBottom[81]={
62676, 59870, 57207, 54679,   //20 到 23 摄氏度
52279, 50000, 47833, 45775,   //24 到 27 摄氏度
43818, 41956, 40185, 38500,   //28 到 31 摄氏度
36896, 35368, 33913, 32527,   //32 到 35 摄氏度
31206, 29947, 28746, 27600,   //36 到 39 摄氏度
26507, 25464, 24468, 23517,   //40 到 43 摄氏度
22608, 21740, 20911, 20118,   //44 到 47 摄氏度
19359, 18634, 17940, 17276,   //48 到 51 摄氏度
16641, 16033, 15450, 14892,   //52 到 55 摄氏度
14357, 13844, 13353, 12882,   //56 到 59 摄氏度
12430, 11997, 11581, 11182,   //60 到 63 摄氏度
10799, 10431, 10078, 9739,   //64 到 67 摄氏度
9413, 9100, 8799, 8509,   //68 到 71 摄氏度
8231, 7963, 7706, 7458,   //72 到 75 摄氏度
7219, 6990, 6769, 6556,   //76 到 79 摄氏度
6351, 6154, 5963, 5780,   //80 到 83 摄氏度
5603, 5433, 5269, 5110,   //84 到 87 摄氏度
4957, 4810, 4667, 4530,   //88 到 91 摄氏度
4397, 4269, 4146, 4026,   //92 到 95 摄氏度
3911, 3800, 3692, 3588,   //96 到 99 摄氏度
};

//NTC温度换算函数
//传入参数：NTC阻值(Ω),温度是否有效的bool指针输出
//返回参数：温度值(℃)
char CalcNTCTemp(bool *IsNTCOK,unsigned long NTCRes){
unsigned char i;
volatile unsigned long NTCTableValue;
//电阻值大于查找表阻值上限，温度异常
if(NTCRes>(unsigned long)2009298)
  {
  *IsNTCOK=false;
  return -40;
  }
//电阻值小于查找表阻值的阻值下限，温度异常
if(NTCRes<(unsigned long)3588)
  {
  *IsNTCOK=false;
  return 100;
  }
//温度正常，开始查表
*IsNTCOK=true;
if(NTCRes>(unsigned long)62676)for(i=0;i<60;i++)if(NTCTableTop[i]<=NTCRes)return -40+i;
for(i=0;i<80;i++)
  {
  NTCTableValue=(unsigned long)NTCTableBottom[i];
  NTCTableValue&=0xFFFF;
  if(NTCTableValue<=NTCRes)return 20+i;
  }
//数值查找失败，返回错误值
*IsNTCOK=false;
return 0;
}

